import 'package:autism_screener/models/car_question.dart';

final List<Map<String, dynamic>> rawCarsQuestions = [
  {
    'question': '1. الاتصال بالناس',
    'options': [
      {'text': 'طبيعي لا يوجد أي دليل على صعوبة', 'score': 1.0},
      {'text': 'علاقات بسيطة غير طبيعية', 'score': 1.5},
      {'text': 'علاقات متوسطة غير طبيعية', 'score': 2.5},
      {'text': 'علاقات شديدة غير طبيعية', 'score': 3.5},
    ],
  },
  {
    'question': '2. التقليد',
    'options': [
      {'text': 'التقليد مناسب', 'score': 1.0},
      {'text': 'تقليد بسيط غير طبيعي', 'score': 1.5},
      {'text': 'تقليد متوسط غير طبيعي', 'score': 2.5},
      {'text': 'التقليد شديد غير طبيعي', 'score': 3.5},
    ],
  },
  {
    'question': '3. الاستجابة العاطفية',
    'options': [
      {'text': 'ردود فعل عاطفية مناسبة حسب السن', 'score': 1.0},
      {'text': 'استجابات عاطفية غير طبيعية بشكل بسيط', 'score': 1.5},
      {'text': 'استجابات عاطفية غير طبيعية بشكل متوسط', 'score': 2.5},
      {'text': 'استجابات عاطفية غير طبيعية بشكل شديد', 'score': 3.5},
    ],
  },
  {
    'question': '4. استخدام الجسد',
    'options': [
      {'text': 'استخدام الجسد بدرجة مناسب للعمر', 'score': 1.0},
      {'text': 'استخدام الجسم غير طبيعي بدرجة بسيطة', 'score': 1.5},
      {'text': 'استخدام الجسم غير طبيعي بدرجة متوسطة', 'score': 2.5},
      {'text': 'استخدام الجسم غير طبيعي بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '5. استخدام الأشياء',
    'options': [
      {'text': 'اهتمام أو استخدام طبيعي للألعاب', 'score': 1.0},
      {'text': 'اهتمام أو استخدام غير طبيعي بدرجة بسيطة', 'score': 1.5},
      {'text': 'اهتمام أو استخدام غير طبيعي بدرجة متوسطة', 'score': 2.5},
      {'text': 'اهتمام أو استخدام غير طبيعي بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '6. التكيف مع التغيير',
    'options': [
      {'text': 'يتكيف مع التغير بدرجة جيدة', 'score': 1.0},
      {'text': 'لا يتكيف مع التغيير (غير طبيعي بدرجة بسيطة)', 'score': 1.5},
      {'text': 'لا يتكيف مع التغيير (غير طبيعي بدرجة متوسطة)', 'score': 2.5},
      {'text': 'لا يتكيف مع التغيير (غير طبيعي بدرجة شديدة)', 'score': 3.5},
    ],
  },
  {
    'question': '7. الاستجابة البصرية',
    'options': [
      {'text': 'استجابته البصرية بدرجة جيدة', 'score': 1.0},
      {'text': 'استجابة بصرية غير طبيعية بدرجة بسيطة', 'score': 1.5},
      {'text': 'استجابة بصرية غير طبيعية بدرجة متوسطة', 'score': 2.5},
      {'text': 'استجابة بصرية غير طبيعية بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '8. الاستجابة السمعية',
    'options': [
      {'text': 'استجابة سمعية طبيعية بالنسبة للعمر', 'score': 1.0},
      {'text': 'استجابة سمعية غير طبيعية بدرجة بسيطة', 'score': 1.5},
      {'text': 'استجابة سمعية غير طبيعية بدرجة متوسطة', 'score': 2.5},
      {'text': 'استجابة سمعية غير طبيعية بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '9. استجابة التذوق والشم واللمس',
    'options': [
      {'text': 'استجابة طبيعية للتذوق والشم واللمس', 'score': 1.0},
      {'text': 'استجابة غير طبيعية بدرجة بسيطة', 'score': 1.5},
      {'text': 'استجابة غير طبيعية بدرجة متوسطة', 'score': 2.5},
      {'text': 'استجابة غير طبيعية بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '10. الخوف أو القلق',
    'options': [
      {'text': 'خوف أو قلق طبيعية', 'score': 1.0},
      {'text': 'خوف أو قلق غير طبيعي بدرجة بسيطة', 'score': 1.5},
      {'text': 'خوف أو قلق غير طبيعي بدرجة متوسطة', 'score': 2.5},
      {'text': 'خوف أو قلق غير طبيعي بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '11. التواصل اللفظي',
    'options': [
      {'text': 'تواصل لفظي طبيعي', 'score': 1.0},
      {'text': 'تواصل لفظي غير طبيعي بدرجة بسيطة', 'score': 1.5},
      {'text': 'تواصل لفظي غير طبيعي بدرجة متوسطة', 'score': 2.5},
      {'text': 'تواصل لفظي غير طبيعي بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '12. التواصل غير اللفظي',
    'options': [
      {'text': 'استخدام طبيعي للتواصل غير اللفظي', 'score': 1.0},
      {'text': 'استخدام غير طبيعي بدرجة بسيطة', 'score': 1.5},
      {'text': 'استخدام غير طبيعي بدرجة متوسطة', 'score': 2.5},
      {'text': 'استخدام غير طبيعي بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '13. مستوى النشاط',
    'options': [
      {'text': 'مستوى نشاط طبيعي', 'score': 1.0},
      {'text': 'مستوى نشاط غير طبيعي بدرجة بسيطة', 'score': 1.5},
      {'text': 'مستوى نشاط غير طبيعي بدرجة متوسطة', 'score': 2.5},
      {'text': 'مستوى نشاط غير طبيعي بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '14. مستوى واتساق الاستجابة الفكرية',
    'options': [
      {'text': 'الذكاء طبيعي ومتسق', 'score': 1.0},
      {'text': 'أداء فكري غير طبيعي بدرجة بسيطة', 'score': 1.5},
      {'text': 'أداء فكري غير طبيعي بدرجة متوسطة', 'score': 2.5},
      {'text': 'أداء فكري غير طبيعي بدرجة شديدة', 'score': 3.5},
    ],
  },
  {
    'question': '15. الانطباعات العامة',
    'options': [
      {'text': 'ليس توحد - لا تظهر فيه صفات التوحد', 'score': 1.0},
      {'text': 'توحد بسيط - لديه بعض الصفات', 'score': 1.5},
      {'text': 'توحد متوسط - لديه صفات واضحة', 'score': 2.5},
      {'text': 'توحد شديد - لديه معظم صفات التوحد', 'score': 3.5},
    ],
  },
];
final List<CarQuestion> carsQuestions = rawCarsQuestions
    .map((json) => CarQuestion.fromJson(json))
    .toList();
